## Eksik Veri

In [5]:
import pandas as pd
import numpy as np

In [7]:
sozlukVerisi = {
    "Istanbul": [30,29,np.nan],
    "Ankara": [20,np.nan,25],
    "Izmir": [40,39,38]}

havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [9]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

#### 1) olmayan verileri silebilirsin, ama satırları,sutünları komple siliyor.
#### 2) fillna(20) ile değer atayabilirz
#### 3) ort değer kullanabilirz
axis = 0 satır, axis = 1 sutün

In [28]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [30]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [32]:
yeniveri = {
    "Istanbul": [30,29,np.nan],
    "Ankara": [20,np.nan,25],
    "Izmir": [40,39,38],
    "Antalya": [40,np.nan,np.nan]}

yeniDataFrame = pd.DataFrame(yeniveri)

In [34]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     40.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [38]:
yeniDataFrame.dropna(axis=1,thresh=2) #2 ve üzeri nan olanları at, axis=1 columnda

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [40]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     40.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [44]:
yeniDataFrame.fillna(20) #boşlara 20 yazdı

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     40.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

In [49]:
mean_values = yeniDataFrame.mean()
yeniDataFrame.fillna(mean_values)   #columnların ort değeri ile dolduruldu

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     40.0
1      29.0    22.5     39     40.0
2      29.5    25.0     38     40.0

## GroupBy

In [63]:
maasSozluk = {
    "Departman": ["yazılım","satış","yazılım","satış","hukuk","hukuk"],
    "Calisan ısmı" : ["ahmet","mehmet","ayşe","burak","atıl","zeynep"],
    "Maas": [1800,1495,4234,875,9765,56788]}

In [65]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [67]:
maasDataFrame

  Departman Calisan ısmı   Maas
0   yazılım        ahmet   1800
1     satış       mehmet   1495
2   yazılım         ayşe   4234
3     satış        burak    875
4     hukuk         atıl   9765
5     hukuk       zeynep  56788

In [71]:
maasDataFrame.groupby("Departman")

In [73]:
grupobjesi = maasDataFrame.groupby("Departman")

In [81]:
grupobjesi.count()

           Calisan ısmı  Maas
Departman
hukuk                 2     2
satış                 2     2
yazılım               2     2

In [85]:
grupobjesi.mean("Maas")

              Maas
Departman
hukuk      33276.5
satış       1185.0
yazılım     3017.0

In [89]:
grupobjesi.min()

          Calisan ısmı  Maas
Departman
hukuk             atıl  9765
satış            burak   875
yazılım          ahmet  1800

In [91]:
grupobjesi.describe()

           Maas                                                              \
          count     mean           std     min       25%      50%       75%
Departman
hukuk       2.0  33276.5  33250.282172  9765.0  21520.75  33276.5  45032.25
satış       2.0   1185.0    438.406204   875.0   1030.00   1185.0   1340.00
yazılım     2.0   3017.0   1721.097905  1800.0   2408.50   3017.0   3625.50


               max
Departman
hukuk      56788.0
satış       1495.0
yazılım     4234.0